In [2]:
### Installation
#To install Pandas, use the following command:

#pip install pandas


### Importing Pandas

import pandas as pd
import numpy as np

In [3]:
#### 2. Data Structures
# *Series*:
#  - Creating a Series: pd.Series().
#  - Accessing and modifying data in a Series.
#You can also specify the index:
  
#- *DataFrame*:
#  - Creating a DataFrame: pd.DataFrame(), from dictionaries, lists, or external data sources.
#  - Accessing data using .loc[] and .iloc[].

In [4]:
# *Series*:
data = [1, 2, 3, 4, 5]
s = pd.Series(data)
print(s)
print()
#You can also specify the index:

series = pd.Series(data, index=['a', 'b', 'c', 'd', 'e'])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
cost = [1000, 564654, 56456, 555]
contry = ['india', 'puri', 'bbsr', 'goa']
s = pd.Series(cost,index = contry)
s

india      1000
puri     564654
bbsr      56456
goa         555
dtype: int64

In [6]:
# create series with a tuple
cost = (320,565,565,32,48)
city = ('bbsr','puri','khordha','kerla','cuttack')
w = pd.Series(city, index = cost)
w

320       bbsr
565       puri
565    khordha
32       kerla
48     cuttack
dtype: object

In [7]:
# create series with a dictionary
data = {'bbsr':5665,'puri':55248,'khordha':554652,'kerla':899798,'cuttack':5887}
d = pd.Series(data)
d

bbsr         5665
puri        55248
khordha    554652
kerla      899798
cuttack      5887
dtype: int64

In [8]:
#- *DataFrame*:
myList = [['apple','red'],['banana', 'yellow'],['orange','orange']]
list = pd.DataFrame(myList)
print(list)
print()

df = pd.DataFrame(myList,columns = ['fruit','color'])
df

        0       1
0   apple     red
1  banana  yellow
2  orange  orange

    fruit   color
0   apple     red
1  banana  yellow
2  orange  orange

In [9]:
####  - Creating a DataFrame: pd.DataFrame().
dict = {'name': ['dj','dip','jd','lul'], 'age': [35,65,32,41], 'salary': [566,234,56,35]}
dic = pd.DataFrame(dict)
dic

  name  age  salary
0   dj   35     566
1  dip   65     234
2   jd   32      56
3  lul   41      35

In [10]:
#### create a empty DataFrame and add rows and column
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [11]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [12]:
col = ['id', 'name', 'age', 'exp']
df = pd.DataFrame(columns= col)
df

Empty DataFrame
Columns: [id, name, age, exp]
Index: []

In [13]:
#### data frame with list 
df1 = pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [14]:
print(df1)

Empty DataFrame
Columns: []
Index: []

In [15]:
df1['id'] = [101,201,301]
df1['name'] = ['a','b','c']
df1['age'] = [45,46,52]
df1['exp'] = [5,4,5]
df1

    id name  age  exp
0  101    a   45    5
1  201    b   46    4
2  301    c   52    5

In [16]:
df3 = pd.DataFrame(columns=['id', 'name', 'age', 'exp'],index = [1,2,3,4])
df3

    id name  age  exp
1  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN

In [17]:
df3['id'] = [101,102,103,104]
df3

    id name  age  exp
1  101  NaN  NaN  NaN
2  102  NaN  NaN  NaN
3  103  NaN  NaN  NaN
4  104  NaN  NaN  NaN

In [18]:
df3['age'] = [45,65,46,89]
df3

    id name  age  exp
1  101  NaN   45  NaN
2  102  NaN   65  NaN
3  103  NaN   46  NaN
4  104  NaN   89  NaN

In [19]:
df4 = pd.DataFrame([[1,2],[3,4]],columns = ['A','b'])
df4

   A  b
0  1  2
1  3  4

In [20]:
df5 = pd.DataFrame()
df5['id'] = [101,201,301,401,501,601,701,801,901,1011]
df5['name'] = ['a','b','c','d','e','f','g','h','i','j']
df5['age'] = [45,46,52,54,76,25,65,55,25,12]
df5['exp'] = [5,4,5,6,5,6,5,6,5,5]
df5

     id name  age  exp
0   101    a   45    5
1   201    b   46    4
2   301    c   52    5
3   401    d   54    6
4   501    e   76    5
5   601    f   25    6
6   701    g   65    5
7   801    h   55    6
8   901    i   25    5
9  1011    j   12    5

In [21]:
### single column indexing
df5['age']

0    45
1    46
2    52
3    54
4    76
5    25
6    65
7    55
8    25
9    12
Name: age, dtype: int64

In [22]:
### adding multiple column indexing
df5[['age','name']]

   age name
0   45    a
1   46    b
2   52    c
3   54    d
4   76    e
5   25    f
6   65    g
7   55    h
8   25    i
9   12    j

In [23]:
#### asign a column value to another column
df5['exp'] = df5['age']
df5
### you can also assign multiple col like this
### df5[['exp', 'age']] = df5[['name','id']]

     id name  age  exp
0   101    a   45   45
1   201    b   46   46
2   301    c   52   52
3   401    d   54   54
4   501    e   76   76
5   601    f   25   25
6   701    g   65   65
7   801    h   55   55
8   901    i   25   25
9  1011    j   12   12

In [24]:
df6 = pd.DataFrame(df5)
df6

     id name  age  exp
0   101    a   45   45
1   201    b   46   46
2   301    c   52   52
3   401    d   54   54
4   501    e   76   76
5   601    f   25   25
6   701    g   65   65
7   801    h   55   55
8   901    i   25   25
9  1011    j   12   12

In [25]:
### you can also assign multiple col like this
df6[['exp', 'age']] = df6[['name','id']]
df6

     id name   age exp
0   101    a   101   a
1   201    b   201   b
2   301    c   301   c
3   401    d   401   d
4   501    e   501   e
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

In [26]:
#### row slicing
df6[:]

     id name   age exp
0   101    a   101   a
1   201    b   201   b
2   301    c   301   c
3   401    d   401   d
4   501    e   501   e
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

In [27]:
df6[5:]

     id name   age exp
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

In [28]:
df6[2:7:2]

    id name  age exp
2  301    c  301   c
4  501    e  501   e
6  701    g  701   g

In [29]:
df6[::-1]

     id name   age exp
9  1011    j  1011   j
8   901    i   901   i
7   801    h   801   h
6   701    g   701   g
5   601    f   601   f
4   501    e   501   e
3   401    d   401   d
2   301    c   301   c
1   201    b   201   b
0   101    a   101   a

In [30]:
##### #  - Accessing data using .loc[] and .iloc[].
df6.iloc[1]

id      201
name      b
age     201
exp       b
Name: 1, dtype: object

In [31]:
df6.iloc[2,3]

'c'

In [32]:
df6.iloc[[1,2,3]]

    id name  age exp
1  201    b  201   b
2  301    c  301   c
3  401    d  401   d

In [33]:
df6.iloc[[1,2,3],[2,3]]

   age exp
1  201   b
2  301   c
3  401   d

In [34]:
####### - Accessing data using .loc[]
df6.loc[[2,3,5],'age']

2    301
3    401
5    601
Name: age, dtype: int64

In [35]:
df6.loc[5:,['age','id']]

    age    id
5   601   601
6   701   701
7   801   801
8   901   901
9  1011  1011

In [36]:
#### 3. DataFrame Operations
#- *Data Inspection*:
#  - Viewing data: head(), tail().
#  - Summarizing data: info(), describe(), shape.

#*** Viewing Data
#- head(n): Returns the first n rows.
#- tail(n): Returns the last n rows.
#- info(): Provides a summary of the DataFrame.
#- describe(): Generates descriptive statistics.

####- *Data Selection and Filtering*:
#  - Selecting columns and rows.
#  - Filtering data based on conditions.

#*** Selection and Indexing
#- Selecting a column:  print(df['A'])
#- Selecting multiple columns:  print(df[['A', 'B']])
#- Selecting rows by index label:  print(df.loc[0])
#- Selecting rows by index position:  print(df.iloc[0])

#*** Boolean Indexing
#print(df[df['A'] > 1])

#*** Adding and Removing Columns
#- Adding a new column:  df['D'] = [10, 11, 12]
  
#- Removing a column:  df = df.drop('D', axis=1)

In [37]:
df6.head()

    id name  age exp
0  101    a  101   a
1  201    b  201   b
2  301    c  301   c
3  401    d  401   d
4  501    e  501   e

In [38]:
df6.head(2)

    id name  age exp
0  101    a  101   a
1  201    b  201   b

In [39]:
df6.tail()

     id name   age exp
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

In [40]:
df6.tail(6)

     id name   age exp
4   501    e   501   e
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

In [41]:
df6.shape

(10, 4)

In [42]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10 non-null     int64
 1   name    10 non-null     object
 2   age     10 non-null     int64
 3   exp     10 non-null     object
dtypes: int64(2), object(2)
memory usage: 452.0+ bytes

In [43]:
df6.describe()

                id          age
count    10.000000    10.000000
mean    552.000000   552.000000
std     304.428426   304.428426
min     101.000000   101.000000
25%     326.000000   326.000000
50%     551.000000   551.000000
75%     776.000000   776.000000
max    1011.000000  1011.000000

#  - Filtering data based on conditions.

In [44]:
df6.filter(['id','age'])

     id   age
0   101   101
1   201   201
2   301   301
3   401   401
4   501   501
5   601   601
6   701   701
7   801   801
8   901   901
9  1011  1011

In [45]:
# df6.filter(['id','age'],like='age')

In [46]:
df6.filter(like='age')

    age
0   101
1   201
2   301
3   401
4   501
5   601
6   701
7   801
8   901
9  1011

In [47]:
#### - Adding a new column:  df['D'] = [10, 11, 12]
df6['total'] = 0
df6

     id name   age exp  total
0   101    a   101   a      0
1   201    b   201   b      0
2   301    c   301   c      0
3   401    d   401   d      0
4   501    e   501   e      0
5   601    f   601   f      0
6   701    g   701   g      0
7   801    h   801   h      0
8   901    i   901   i      0
9  1011    j  1011   j      0

In [48]:
#### manipulating columns: 
df6['total'] = df6['id'] + df6['age']
df6

     id name   age exp  total
0   101    a   101   a    202
1   201    b   201   b    402
2   301    c   301   c    602
3   401    d   401   d    802
4   501    e   501   e   1002
5   601    f   601   f   1202
6   701    g   701   g   1402
7   801    h   801   h   1602
8   901    i   901   i   1802
9  1011    j  1011   j   2022

In [49]:
#### delete a column: but does not change the data
df6

     id name   age exp  total
0   101    a   101   a    202
1   201    b   201   b    402
2   301    c   301   c    602
3   401    d   401   d    802
4   501    e   501   e   1002
5   601    f   601   f   1202
6   701    g   701   g   1402
7   801    h   801   h   1602
8   901    i   901   i   1802
9  1011    j  1011   j   2022

In [50]:
#### to delete or remove:
df6.drop(columns= 'total')

     id name   age exp
0   101    a   101   a
1   201    b   201   b
2   301    c   301   c
3   401    d   401   d
4   501    e   501   e
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

In [51]:
#### delete a column: but does not change the data
df6

     id name   age exp  total
0   101    a   101   a    202
1   201    b   201   b    402
2   301    c   301   c    602
3   401    d   401   d    802
4   501    e   501   e   1002
5   601    f   601   f   1202
6   701    g   701   g   1402
7   801    h   801   h   1602
8   901    i   901   i   1802
9  1011    j  1011   j   2022

In [52]:
#### permanent delete column:
df6 = df6.drop(columns='total')

In [53]:
df6

     id name   age exp
0   101    a   101   a
1   201    b   201   b
2   301    c   301   c
3   401    d   401   d
4   501    e   501   e
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

# Boolean Indexing

In [54]:
boolean = df6['age'] > 500

boolean

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
Name: age, dtype: bool

In [55]:
boolean.count() #                                      count()

np.int64(10)

In [56]:
boolean.value_counts() #                                value_counts()

age
True     6
False    4
Name: count, dtype: int64

In [57]:
df6.loc[boolean]

     id name   age exp
4   501    e   501   e
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

In [58]:
# df6.iloc[boolean] cause an error
#df6.iloc[list(df6.age > 500)]

In [59]:
df6

     id name   age exp
0   101    a   101   a
1   201    b   201   b
2   301    c   301   c
3   401    d   401   d
4   501    e   501   e
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

In [60]:
df9 = df6

In [61]:
df9

     id name   age exp
0   101    a   101   a
1   201    b   201   b
2   301    c   301   c
3   401    d   401   d
4   501    e   501   e
5   601    f   601   f
6   701    g   701   g
7   801    h   801   h
8   901    i   901   i
9  1011    j  1011   j

In [62]:
df9.iloc[4,2] = np.nan

In [63]:
df9

     id name     age exp
0   101    a   101.0   a
1   201    b   201.0   b
2   301    c   301.0   c
3   401    d   401.0   d
4   501    e     NaN   e
5   601    f   601.0   f
6   701    g   701.0   g
7   801    h   801.0   h
8   901    i   901.0   i
9  1011    j  1011.0   j

In [135]:
#### 4. Data Cleaning
#- *Handling Missing Data*:
#  - Identifying missing data: isnull(), notnull().
#  - Filling missing values: fillna(), interpolate().
#  - Dropping missing values: dropna().

#- *Data Transformation*:
#  - Applying functions: apply(), map().
#  - Replacing values: replace().
#  - Removing duplicates: drop_duplicates().

#- *Data Manipulation*:
#  - Renaming- Renaming columns:
#  - Sorting- Sorting by index:
#           - Sorting by values:

#### Some advaced concept
# - median()
# - count() - how much data fill / not blank
# - value_counts() - count how much data of unique value is there
# - value_counts(normalize = True) - calculate in percentage
# - sort_values(by = 'column name', ascending = False )

# Handling Missing Data:

In [65]:
df3
df7 = pd.DataFrame(df3)

In [66]:
df3.iloc[1,1] = 'na'
df3.loc[1:,'exp'] = 'N/A'

In [67]:
dff5 = df3
df3

    id name  age  exp
1  101  NaN   45  N/A
2  102   na   65  N/A
3  103  NaN   46  N/A
4  104  NaN   89  N/A

In [68]:
df3.isna()

      id   name    age    exp
1  False   True  False  False
2  False  False  False  False
3  False   True  False  False
4  False   True  False  False

In [69]:
df3.isnull()

      id   name    age    exp
1  False   True  False  False
2  False  False  False  False
3  False   True  False  False
4  False   True  False  False

In [70]:
df3.notnull()

     id   name   age   exp
1  True  False  True  True
2  True   True  True  True
3  True  False  True  True
4  True  False  True  True

In [71]:
df3.isnull().sum()

id      0
name    3
age     0
exp     0
dtype: int64

# handeling the problem

In [72]:
missing_values = ['N/a','na','NaN']
#df3 = pd.read_csv('data.csv',na_values =missing_values)
# cause an error i dont have data.csv

In [73]:
df3.isnull().sum()

id      0
name    3
age     0
exp     0
dtype: int64

In [74]:
df3.isnull().any()

id      False
name     True
age     False
exp     False
dtype: bool

#  - Dropping missing values: dropna().

In [75]:
df3.dropna()

    id name  age  exp
2  102   na   65  N/A

In [76]:
df3.dropna(how = 'all')

    id name  age  exp
1  101  NaN   45  N/A
2  102   na   65  N/A
3  103  NaN   46  N/A
4  104  NaN   89  N/A

# - to change the original data .dropna(inplace= True)

In [77]:
df17 = df3

In [78]:
df17

    id name  age  exp
1  101  NaN   45  N/A
2  102   na   65  N/A
3  103  NaN   46  N/A
4  104  NaN   89  N/A

In [79]:
df17.dropna()

    id name  age  exp
2  102   na   65  N/A

In [80]:
df17.dropna(inplace = True)

In [81]:
df17

    id name  age  exp
2  102   na   65  N/A

#  - Filling missing values: fillna(), interpolate().

In [82]:
df7

    id name  age  exp
1  101  NaN   45  N/A
2  102   na   65  N/A
3  103  NaN   46  N/A
4  104  NaN   89  N/A

In [83]:
#### this not for good cleaning
print(df7.fillna(0))

    id name  age  exp
1  101    0   45  N/A
2  102   na   65  N/A
3  103    0   46  N/A
4  104    0   89  N/A

# fillna(method = 'ffill')

In [84]:
df7

    id name  age  exp
1  101  NaN   45  N/A
2  102   na   65  N/A
3  103  NaN   46  N/A
4  104  NaN   89  N/A

In [85]:
df7.ffill()

    id name  age  exp
1  101  NaN   45  N/A
2  102   na   65  N/A
3  103   na   46  N/A
4  104   na   89  N/A

# fillna(method = 'bfill')

In [86]:
df7.bfill()

    id name  age  exp
1  101   na   45  N/A
2  102   na   65  N/A
3  103  NaN   46  N/A
4  104  NaN   89  N/A

In [87]:
#### to replace all nan values
df7.fillna({
    'name': 'jitu'
})

    id  name  age  exp
1  101  jitu   45  N/A
2  102    na   65  N/A
3  103  jitu   46  N/A
4  104  jitu   89  N/A

# interpolate()

In [88]:
data = {
    'id': [101, 201, 301, 401, 501, 601, 701, 801, 901, 1011],
    'name': ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'],
    'age': [101, 201, 301, 401, np.nan, 601, 701, 801, 901, 1011],
    'exp': ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
}
df8 = pd.DataFrame(data)

In [89]:
print(df8.dtypes)

id        int64
name     object
age     float64
exp      object
dtype: object

In [132]:
df8.interpolate() # total data is not numerical

C:\Users\91700\AppData\Local\Temp\ipykernel_956\1397301956.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df8.interpolate() # total data is not numerical

     id name     age exp
0   101    a   101.0   a
1   201    b   201.0   b
2   301    c   301.0   c
3   401    d   401.0   d
4   501    e   501.0   e
5   601    f   601.0   f
6   701    g   701.0   g
7   801    h   801.0   h
8   901    i   901.0   i
9  1011    j  1011.0   j

In [91]:
print(df8.dtypes)

id        int64
name     object
age     float64
exp      object
dtype: object

In [92]:
df8

     id name     age exp
0   101    a   101.0   a
1   201    b   201.0   b
2   301    c   301.0   c
3   401    d   401.0   d
4   501    e     NaN   e
5   601    f   601.0   f
6   701    g   701.0   g
7   801    h   801.0   h
8   901    i   901.0   i
9  1011    j  1011.0   j

In [93]:
df8['age'].fillna(0)

0     101.0
1     201.0
2     301.0
3     401.0
4       0.0
5     601.0
6     701.0
7     801.0
8     901.0
9    1011.0
Name: age, dtype: float64

In [134]:
df8['age'].interpolate()

0     101.0
1     201.0
2     301.0
3     401.0
4     501.0
5     601.0
6     701.0
7     801.0
8     901.0
9    1011.0
Name: age, dtype: float64

In [94]:
df8.loc[:,'age'].interpolate()

0     101.0
1     201.0
2     301.0
3     401.0
4     501.0
5     601.0
6     701.0
7     801.0
8     901.0
9    1011.0
Name: age, dtype: float64

# - using mean() to fill

In [95]:
import math
df8['age'].fillna(math.floor(df8['age'].mean()))

0     101.0
1     201.0
2     301.0
3     401.0
4     557.0
5     601.0
6     701.0
7     801.0
8     901.0
9    1011.0
Name: age, dtype: float64

# - Data Transformation:
### - Applying functions: apply(), map().
### - Replacing values: replace().
### - Removing duplicates: drop_duplicates().

# - *Data Manipulation*:
###  - Renaming- Renaming columns:
###  - Sorting- Sorting by index:
###  - Sorting by values:

In [96]:
# 5. Data Manipulation
## - *Data Merging and Concatenation*:
####  - Merging DataFrames: merge().
####  - Concatenating DataFrames: concat().
####  - Joining DataFrames: join().



## - *Grouping Data*:
####  - Grouping data: groupby().
####  - Aggregating data: agg(), aggregate().
####  - Aggregation functions: grouped.mean(), grouped.sum(), grouped.size()

# crosstab()


## - *Reshaping Data*:
####  - Pivot tables: pivot_table().
####  - Melting data: melt().

# - *Grouping Data*:
####  - Grouping data: groupby().
####  - Aggregating data: agg(), aggregate().
####  - Aggregation functions: grouped.mean(), grouped.sum(), grouped.size()

In [97]:
df = pd.read_csv('data\developer-survey-2023\survey_results_public.csv')

In [98]:
df.head(2)

,ResponseId,Q120,MainBranch,Age,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,...,Frequency_1,Frequency_2,Frequency_3,TimeSearching,TimeAnswering,ProfessionalTech,Industry,SurveyLength,SurveyEase,ConvertedCompYearly
0,1,I agree,None of these,18-24 years old,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,I agree,I am a developer by profession,25-34 years old,"Employed, full-time",Remote,Hobby;Contribute to open-source projects;Boots...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Colleague;Friend or fam...,Formal documentation provided by the owner of ...,...,1-2 times a week,10+ times a week,Never,15-30 minutes a day,15-30 minutes a day,DevOps function;Microservices;Automated testin...,"Information Services, IT, Software Development...",Appropriate in length,Easy,285000.0

In [99]:
df['ConvertedCompYearly'].head(15)

0          NaN
1     285000.0
2     250000.0
3     156000.0
4      23456.0
5      96828.0
6     135000.0
7      80000.0
8      64254.0
9          NaN
10         NaN
11     78003.0
12     75000.0
13    150000.0
14    187407.0
Name: ConvertedCompYearly, dtype: float64

In [100]:
df['ConvertedCompYearly'].median()

np.float64(74963.0)

In [101]:
df.median(numeric_only=True)

ResponseId              44592.5
CompTotal              115000.0
WorkExp                     9.0
ConvertedCompYearly     74963.0
dtype: float64

In [102]:
df.dtypes

ResponseId               int64
Q120                    object
MainBranch              object
Age                     object
Employment              object
                        ...
ProfessionalTech        object
Industry                object
SurveyLength            object
SurveyEase              object
ConvertedCompYearly    float64
Length: 84, dtype: object

In [103]:
col = df.dtypes != 'object'

In [104]:
df.value_counts()

Series([], Name: count, dtype: int64)

In [105]:
col.sum()

np.int64(4)

In [106]:
df.describe()

         ResponseId     CompTotal       WorkExp  ConvertedCompYearly
count  89184.000000  4.822500e+04  43579.000000         4.801900e+04
mean   44592.500000  1.036807e+42     11.405126         1.031101e+05
std    25745.347541  2.276847e+44      9.051989         6.814188e+05
min        1.000000  0.000000e+00      0.000000         1.000000e+00
25%    22296.750000  6.300000e+04      5.000000         4.390700e+04
50%    44592.500000  1.150000e+05      9.000000         7.496300e+04
75%    66888.250000  2.300000e+05     16.000000         1.216410e+05
max    89184.000000  5.000000e+46     50.000000         7.435143e+07

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89184 entries, 0 to 89183
Data columns (total 84 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   ResponseId                           89184 non-null  int64
 1   Q120                                 89184 non-null  object
 2   MainBranch                           89184 non-null  object
 3   Age                                  89184 non-null  object
 4   Employment                           87898 non-null  object
 5   RemoteWork                           73810 non-null  object
 6   CodingActivities                     73764 non-null  object
 7   EdLevel                              87973 non-null  object
 8   LearnCode                            87663 non-null  object
 9   LearnCodeOnline                      70084 non-null  object
 10  LearnCodeCoursesCert                 37076 non-null  object
 11  YearsCode                            87435 non-null  object
 12  YearsCodePro                         66136 non-null  object
 13  DevType                              76872 non-null  object
 14  OrgSize                              65043 non-null  object
 15  PurchaseInfluence                    64964 non-null  object
 16  TechList                             60851 non-null  object
 17  BuyNewTool                           83009 non-null  object
 18  Country                              87973 non-null  object
 19  Currency                             65334 non-null  object
 20  CompTotal                            48225 non-null  float64
 21  LanguageHaveWorkedWith               87140 non-null  object
 22  LanguageWantToWorkWith               80709 non-null  object
 23  DatabaseHaveWorkedWith               73435 non-null  object
 24  DatabaseWantToWorkWith               60911 non-null  object
 25  PlatformHaveWorkedWith               63628 non-null  object
 26  PlatformWantToWorkWith               51308 non-null  object
 27  WebframeHaveWorkedWith               66938 non-null  object
 28  WebframeWantToWorkWith               56741 non-null  object
 29  MiscTechHaveWorkedWith               57019 non-null  object
 30  MiscTechWantToWorkWith               46848 non-null  object
 31  ToolsTechHaveWorkedWith              77884 non-null  object
 32  ToolsTechWantToWorkWith              68315 non-null  object
 33  NEWCollabToolsHaveWorkedWith         85864 non-null  object
 34  NEWCollabToolsWantToWorkWith         76649 non-null  object
 35  OpSysPersonal use                    86557 non-null  object
 36  OpSysProfessional use                78587 non-null  object
 37  OfficeStackAsyncHaveWorkedWith       69090 non-null  object
 38  OfficeStackAsyncWantToWorkWith       53743 non-null  object
 39  OfficeStackSyncHaveWorkedWith        83439 non-null  object
 40  OfficeStackSyncWantToWorkWith        69776 non-null  object
 41  AISearchHaveWorkedWith               56328 non-null  object
 42  AISearchWantToWorkWith               46150 non-null  object
 43  AIDevHaveWorkedWith                  25904 non-null  object
 44  AIDevWantToWorkWith                  19587 non-null  object
 45  NEWSOSites                           87973 non-null  object
 46  SOVisitFreq                          87140 non-null  object
 47  SOAccount                            87852 non-null  object
 48  SOPartFreq                           66061 non-null  object
 49  SOComm                               87692 non-null  object
 50  SOAI                                 47858 non-null  object
 51  AISelect                             87973 non-null  object
 52  AISent                               61501 non-null  object
 53  AIAcc                                38594 non-null  object
 54  AIBen                                61396 non-null  object
 55  AIToolInterested in Using            32783 non-null  object
 56  AIToolCurrently Using                36137 non-null  object
 57  AIToolNot interested in Using        21069 non-null  object
 58  AINextVery different                 12661 non-null  object
 59  AINextNeither different nor similar  6599 non-null   object
 60  AINextSomewhat similar               6238 non-null   object
 61  AINextVery similar                   2621 non-null   object
 62  AINextSomewhat different             23303 non-null  object
 63  TBranch                              65768 non-null  object
 64  ICorPM                               43668 non-null  object
 65  WorkExp                              43579 non-null  float64
 66  Knowledge_1                          42535 non-null  object
 67  Knowledge_2                          41670 non-null  object
 68  Knowledge_3                          41798 non-null  object
 69  Knowledge_4                          41684 non-null  object
 70  Knowledge_5                          41527 non-null  object
 71  Knowledge_6                          41520 non-null  object
 72  Knowledge_7                          41467 non-null  object
 73  Knowledge_8                          41404 non-null  object
 74  Frequency_1                          41916 non-null  object
 75  Frequency_2                          41925 non-null  object
 76  Frequency_3                          41054 non-null  object
 77  TimeSearching                        42778 non-null  object
 78  TimeAnswering                        42629 non-null  object
 79  ProfessionalTech                     41783 non-null  object
 80  Industry                             36774 non-null  object
 81  SurveyLength                         86485 non-null  object
 82  SurveyEase                           86554 non-null  object
 83  ConvertedCompYearly                  48019 non-null  float64
dtypes: float64(3), int64(1), object(80)
memory usage: 57.2+ MB

# .count() is how much people answer

In [108]:
df.count()

ResponseId             89184
Q120                   89184
MainBranch             89184
Age                    89184
Employment             87898
                       ...
ProfessionalTech       41783
Industry               36774
SurveyLength           86485
SurveyEase             86554
ConvertedCompYearly    48019
Length: 84, dtype: int64

In [109]:
df.columns

Index(['ResponseId', 'Q120', 'MainBranch', 'Age', 'Employment', 'RemoteWork',
       'CodingActivities', 'EdLevel', 'LearnCode', 'LearnCodeOnline',
       'LearnCodeCoursesCert', 'YearsCode', 'YearsCodePro', 'DevType',
       'OrgSize', 'PurchaseInfluence', 'TechList', 'BuyNewTool', 'Country',
       'Currency', 'CompTotal', 'LanguageHaveWorkedWith',
       'LanguageWantToWorkWith', 'DatabaseHaveWorkedWith',
       'DatabaseWantToWorkWith', 'PlatformHaveWorkedWith',
       'PlatformWantToWorkWith', 'WebframeHaveWorkedWith',
       'WebframeWantToWorkWith', 'MiscTechHaveWorkedWith',
       'MiscTechWantToWorkWith', 'ToolsTechHaveWorkedWith',
       'ToolsTechWantToWorkWith', 'NEWCollabToolsHaveWorkedWith',
       'NEWCollabToolsWantToWorkWith', 'OpSysPersonal use',
       'OpSysProfessional use', 'OfficeStackAsyncHaveWorkedWith',
       'OfficeStackAsyncWantToWorkWith', 'OfficeStackSyncHaveWorkedWith',
       'OfficeStackSyncWantToWorkWith', 'AISearchHaveWorkedWith',
       'AISearchWantToWorkWith', 'AIDevHaveWorkedWith', 'AIDevWantToWorkWith',
       'NEWSOSites', 'SOVisitFreq', 'SOAccount', 'SOPartFreq', 'SOComm',
       'SOAI', 'AISelect', 'AISent', 'AIAcc', 'AIBen',
       'AIToolInterested in Using', 'AIToolCurrently Using',
       'AIToolNot interested in Using', 'AINextVery different',
       'AINextNeither different nor similar', 'AINextSomewhat similar',
       'AINextVery similar', 'AINextSomewhat different', 'TBranch', 'ICorPM',
       'WorkExp', 'Knowledge_1', 'Knowledge_2', 'Knowledge_3', 'Knowledge_4',
       'Knowledge_5', 'Knowledge_6', 'Knowledge_7', 'Knowledge_8',
       'Frequency_1', 'Frequency_2', 'Frequency_3', 'TimeSearching',
       'TimeAnswering', 'ProfessionalTech', 'Industry', 'SurveyLength',
       'SurveyEase', 'ConvertedCompYearly'],
      dtype='object')

# what answer how many times come .value_counts()

In [110]:
df['Country'].value_counts()

Country
United States of America                                18647
Germany                                                  7328
India                                                    5625
United Kingdom of Great Britain and Northern Ireland     5552
Canada                                                   3507
                                                        ...
Saint Kitts and Nevis                                       1
Samoa                                                       1
Marshall Islands                                            1
Central African Republic                                    1
San Marino                                                  1
Name: count, Length: 185, dtype: int64

# normalize=True means value in percentage

In [111]:
df['Country'].value_counts(normalize=True)

Country
United States of America                                0.211963
Germany                                                 0.083298
India                                                   0.063940
United Kingdom of Great Britain and Northern Ireland    0.063110
Canada                                                  0.039865
                                                          ...
Saint Kitts and Nevis                                   0.000011
Samoa                                                   0.000011
Marshall Islands                                        0.000011
Central African Republic                                0.000011
San Marino                                              0.000011
Name: proportion, Length: 185, dtype: float64

In [112]:
df['Industry'].value_counts()

Industry
Information Services, IT, Software Development, or other Technology    18159
Financial Services                                                      4421
Other                                                                   4011
Manufacturing, Transportation, or Supply Chain                          2607
Healthcare                                                              2216
Retail and Consumer Services                                            1955
Higher Education                                                        1242
Advertising Services                                                     786
Insurance                                                                707
Oil & Gas                                                                276
Legal Services                                                           210
Wholesale                                                                184
Name: count, dtype: int64

#  - Grouping data: groupby().

In [113]:
country_grp = df.groupby(['Country'])

In [114]:
country_grp.get_group(('India',)).head()

,ResponseId,Q120,MainBranch,Age,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,...,Frequency_1,Frequency_2,Frequency_3,TimeSearching,TimeAnswering,ProfessionalTech,Industry,SurveyLength,SurveyEase,ConvertedCompYearly
9,10,I agree,I am a developer by profession,25-34 years old,"Not employed, but looking for work",NaN,NaN,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Online Courses or Certi...,Formal documentation provided by the owner of ...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Neither easy nor difficult,NaN
66,67,I agree,I am a developer by profession,25-34 years old,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby;Contribute to open-source projects,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Online Courses or Certification;School (i.e., ...",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Easy,41197.0
78,79,I agree,I am a developer by profession,18-24 years old,"Employed, full-time",Remote,Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Online Courses or Certification;School (i.e., ...",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN
82,83,I agree,I am a developer by profession,25-34 years old,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Colleague;Friend or fam...,Formal documentation provided by the owner of ...,...,1-2 times a week,1-2 times a week,1-2 times a week,60-120 minutes a day,30-60 minutes a day,DevOps function;Developer portal or other cent...,"Information Services, IT, Software Development...",Appropriate in length,Neither easy nor difficult,NaN
85,86,I agree,I am a developer by profession,25-34 years old,"Employed, full-time",In-person,Other (please specify):,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Online Courses or Certi...,Formal documentation provided by the owner of ...,...,10+ times a week,10+ times a week,10+ times a week,30-60 minutes a day,60-120 minutes a day,Automated testing;Continuous integration (CI) ...,Financial Services,Too long,Neither easy nor difficult,NaN

In [115]:
fil = df['Country'] == 'United States of America'

In [116]:
df.loc[fil].head()

,ResponseId,Q120,MainBranch,Age,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,...,Frequency_1,Frequency_2,Frequency_3,TimeSearching,TimeAnswering,ProfessionalTech,Industry,SurveyLength,SurveyEase,ConvertedCompYearly
1,2,I agree,I am a developer by profession,25-34 years old,"Employed, full-time",Remote,Hobby;Contribute to open-source projects;Boots...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Colleague;Friend or fam...,Formal documentation provided by the owner of ...,...,1-2 times a week,10+ times a week,Never,15-30 minutes a day,15-30 minutes a day,DevOps function;Microservices;Automated testin...,"Information Services, IT, Software Development...",Appropriate in length,Easy,285000.0
2,3,I agree,I am a developer by profession,45-54 years old,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby;Professional development or self-paced l...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Colleague;On the job tr...,Formal documentation provided by the owner of ...,...,6-10 times a week,6-10 times a week,3-5 times a week,30-60 minutes a day,30-60 minutes a day,DevOps function;Microservices;Automated testin...,"Information Services, IT, Software Development...",Appropriate in length,Easy,250000.0
3,4,I agree,I am a developer by profession,25-34 years old,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Colleague;Friend or family member;Other online...,Formal documentation provided by the owner of ...,...,1-2 times a week,10+ times a week,1-2 times a week,15-30 minutes a day,30-60 minutes a day,Automated testing;Continuous integration (CI) ...,NaN,Appropriate in length,Easy,156000.0
6,7,I agree,I am a developer by profession,35-44 years old,"Employed, full-time",Remote,Hobby;Contribute to open-source projects;Profe...,Some college/university study without earning ...,Friend or family member;Online Courses or Cert...,NaN,...,1-2 times a week,3-5 times a week,1-2 times a week,Less than 15 minutes a day,15-30 minutes a day,Microservices;Automated testing;Continuous int...,"Information Services, IT, Software Development...",Appropriate in length,Easy,135000.0
7,8,I agree,I am a developer by profession,25-34 years old,"Employed, full-time",Remote,Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Online Courses or Certi...,Formal documentation provided by the owner of ...,...,NaN,NaN,NaN,60-120 minutes a day,30-60 minutes a day,None of these,Financial Services,NaN,NaN,80000.0

In [117]:
df.loc[fil]['Industry'].value_counts()

Industry
Information Services, IT, Software Development, or other Technology    3185
Other                                                                  1141
Financial Services                                                      982
Healthcare                                                              722
Manufacturing, Transportation, or Supply Chain                          659
Retail and Consumer Services                                            499
Higher Education                                                        333
Insurance                                                               236
Advertising Services                                                    218
Oil & Gas                                                                66
Legal Services                                                           47
Wholesale                                                                34
Name: count, dtype: int64

In [140]:
gp = df.groupby(['Country','Industry'])
gp.head()

,ResponseId,Q120,MainBranch,Age,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,...,Frequency_1,Frequency_2,Frequency_3,TimeSearching,TimeAnswering,ProfessionalTech,Industry,SurveyLength,SurveyEase,ConvertedCompYearly
1,2,I agree,I am a developer by profession,25-34 years old,"Employed, full-time",Remote,Hobby;Contribute to open-source projects;Boots...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Colleague;Friend or fam...,Formal documentation provided by the owner of ...,...,1-2 times a week,10+ times a week,Never,15-30 minutes a day,15-30 minutes a day,DevOps function;Microservices;Automated testin...,"Information Services, IT, Software Development...",Appropriate in length,Easy,285000.0
2,3,I agree,I am a developer by profession,45-54 years old,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby;Professional development or self-paced l...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Colleague;On the job tr...,Formal documentation provided by the owner of ...,...,6-10 times a week,6-10 times a week,3-5 times a week,30-60 minutes a day,30-60 minutes a day,DevOps function;Microservices;Automated testin...,"Information Services, IT, Software Development...",Appropriate in length,Easy,250000.0
4,5,I agree,I am a developer by profession,25-34 years old,"Employed, full-time;Independent contractor, fr...",Remote,Hobby;Contribute to open-source projects;Profe...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Online Courses or Certi...,Formal documentation provided by the owner of ...,...,1-2 times a week,1-2 times a week,3-5 times a week,60-120 minutes a day,30-60 minutes a day,Microservices;Automated testing;Observability ...,Other,Appropriate in length,Neither easy nor difficult,23456.0
5,6,I agree,I am a developer by profession,35-44 years old,"Employed, full-time",Remote,Hobby;Professional development or self-paced l...,Some college/university study without earning ...,Books / Physical media;Colleague;Online Course...,Formal documentation provided by the owner of ...,...,1-2 times a week,1-2 times a week,3-5 times a week,30-60 minutes a day,15-30 minutes a day,DevOps function;Microservices;Observability to...,Other,Appropriate in length,Neither easy nor difficult,96828.0
6,7,I agree,I am a developer by profession,35-44 years old,"Employed, full-time",Remote,Hobby;Contribute to open-source projects;Profe...,Some college/university study without earning ...,Friend or family member;Online Courses or Cert...,NaN,...,1-2 times a week,3-5 times a week,1-2 times a week,Less than 15 minutes a day,15-30 minutes a day,Microservices;Automated testing;Continuous int...,"Information Services, IT, Software Development...",Appropriate in length,Easy,135000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88982,88983,I agree,I am a developer by profession,18-24 years old,"Employed, full-time",Remote,I don’t code outside of work,Primary/elementary school,Books / Physical media;Coding Bootcamp,NaN,...,Never,1-2 times a week,1-2 times a week,Less than 15 minutes a day,15-30 minutes a day,DevOps function;Microservices,Legal Services,Appropriate in length,Easy,NaN
89025,89026,I agree,I am a developer by profession,18-24 years old,"Employed, full-time;Independent contractor, fr...",Remote,Contribute to open-source projects;Professiona...,Some college/university study without earning ...,Books / Physical media;Online Courses or Certi...,Formal documentation provided by the owner of ...,...,1-2 times a week,1-2 times a week,3-5 times a week,30-60 minutes a day,15-30 minutes a day,Automated testing;Observability tools;Continuo...,Retail and Consumer Services,Too long,Neither easy nor difficult,NaN
89094,89095,I agree,I am a developer by profession,25-34 years old,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby;Bootstrapping a business;Professional de...,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",Books / Physical media;Online Courses or Certi...,Formal documentation provided by the owner of ...,...,1-2 times a week,3-5 times a week,1-2 times a week,60-120 minutes a day,30-60 minutes a day,DevOps function;Developer portal or other cent...,Financial Services,Too long,Easy,58218.0
89104,89105,I agree,I am a developer by profession,18-24 years old,"Employed, full-time",In-person,Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","School (i.e., University, College, etc)",NaN,...,1-2 times a week,Never,1-2 times a week,15-30 minutes a day,15-30 minutes a day,None of these,Financial Services,Too long,Easy,NaN
89169,89170,I agree,I am a developer by profession,45-54 years old,"Employed, full-time",Remote,I don’t code outside of work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Other online resources (e.g., videos, blogs, f...",Formal documentation provided by the owner of ...,...,1-2 times a week,1-2 times a week,Never,30-60 minutes a day,30-60 minutes a day,AI-assisted technology tool(s),Advertising Services,Too long,Difficult,NaN

In [118]:
country_grp['Industry'].value_counts()

Country      Industry
Afghanistan  Information Services, IT, Software Development, or other Technology    5
             Advertising Services                                                   3
             Legal Services                                                         2
             Healthcare                                                             1
             Other                                                                  1
                                                                                   ..
Zimbabwe     Information Services, IT, Software Development, or other Technology    3
             Financial Services                                                     2
             Advertising Services                                                   1
             Higher Education                                                       1
             Other                                                                  1
Name: count, Length: 1127, dtype: int64

In [119]:
country_grp['Industry'].value_counts().loc['United States of America']

Industry
Information Services, IT, Software Development, or other Technology    3185
Other                                                                  1141
Financial Services                                                      982
Healthcare                                                              722
Manufacturing, Transportation, or Supply Chain                          659
Retail and Consumer Services                                            499
Higher Education                                                        333
Insurance                                                               236
Advertising Services                                                    218
Oil & Gas                                                                66
Legal Services                                                           47
Wholesale                                                                34
Name: count, dtype: int64

In [120]:
country_grp['CompTotal'].median()

Country
Afghanistan                                 62333.0
Albania                                    104850.0
Algeria                                    540000.0
Andorra                                    120000.0
Angola                                    2600000.0
                                           ...
Venezuela, Bolivarian Republic of...        14400.0
Viet Nam                                200000000.0
Yemen                                        9000.0
Zambia                                      84000.0
Zimbabwe                                    12500.0
Name: CompTotal, Length: 185, dtype: float64

In [121]:
country_grp['CompTotal'].median().loc['United States of America']

np.float64(150000.0)

In [122]:
country_grp['CompTotal'].median().loc['India']

np.float64(1450000.0)

# - Aggregating data: agg(), aggregate().

In [123]:
# to add multiple function at the group

In [124]:
country_grp['CompTotal'].agg(['median','mean','count'])

                                           median          mean  count
Country
Afghanistan                               62333.0  6.666117e+07     14
Albania                                  104850.0  1.185178e+06     20
Algeria                                  540000.0  7.836667e+05     21
Andorra                                  120000.0  1.562473e+09      6
Angola                                  2600000.0  2.600000e+06      2
...                                           ...           ...    ...
Venezuela, Bolivarian Republic of...      14400.0  2.482463e+04     54
Viet Nam                              200000000.0  3.287808e+08    118
Yemen                                      9000.0  2.252071e+06      7
Zambia                                    84000.0  1.507400e+05     10
Zimbabwe                                  12500.0  2.674000e+04     10

[185 rows x 3 columns]

In [125]:
country_grp['CompTotal'].agg(['median','mean','count']).loc['United States of America']

median    1.500000e+05
mean      8.395602e+11
count     1.191100e+04
Name: United States of America, dtype: float64

In [126]:
fil = df['Country'] == 'United States of America'

In [127]:
df.loc[fil]['RemoteWork'].value_counts()

RemoteWork
Remote                                  8889
Hybrid (some remote, some in-person)    5179
In-person                               2058
Name: count, dtype: int64

In [128]:
df.loc[fil]['RemoteWork'].str.contains('Remote')

1         True
2        False
3        False
6         True
7         True
         ...
89150     True
89154    False
89156     True
89175     True
89178     True
Name: RemoteWork, Length: 18647, dtype: object

In [129]:
df.loc[fil]['RemoteWork'].str.contains('Remote').sum()

8889

#### ERROR GROUP DOES NOT HAVE 'str'

In [130]:
country_grp['RemoteWork'].str.contains('Remote').sum()

AttributeError: 'SeriesGroupBy' object has no attribute 'str'

In [144]:
country_grp['RemoteWork'].apply(lambda x: x.str.contains('Remote').sum()).loc['United States of America']

np.int64(8889)

In [145]:
country_grp['RemoteWork'].value_counts().loc['United States of America']

RemoteWork
Remote                                  8889
Hybrid (some remote, some in-person)    5179
In-person                               2058
Name: count, dtype: int64

# what % of people from each country know python

In [142]:
country_grp['LanguageHaveWorkedWith'].value_counts().loc['United States of America']

LanguageHaveWorkedWith
HTML/CSS;JavaScript;TypeScript                      208
Python                                              196
C#;HTML/CSS;JavaScript;SQL;TypeScript               143
C#;HTML/CSS;JavaScript;SQL                          123
C#;HTML/CSS;JavaScript;PowerShell;SQL;TypeScript    108
                                                   ...
SQL;Swift                                             1
SQL;VBA;Visual Basic (.Net)                           1
Scala;SQL                                             1
VBA;Visual Basic (.Net)                               1
Zig                                                   1
Name: count, Length: 9679, dtype: int64

In [143]:
country_grp['LanguageHaveWorkedWith'].apply(lambda x: x.str.contains('Python').sum()).loc['United States of America']

np.int64(10062)

# by using filter method

In [ ]:
filt = df['Country'] == 'United States of America'

In [ ]:
df.loc[filt]['LanguageHaveWorkedWith'].value_counts()

In [ ]:
df.loc[filt]['LanguageHaveWorkedWith'].str.contains('Python').sum()

# - *Data Merging and Concatenation*:
####  - Merging DataFrames: merge().
####  - Concatenating DataFrames: concat().
####  - Joining DataFrames: join().

# - Concatenating DataFrames: concat().

#### anser the question with concalt()

In [ ]:
country_pd = df['Country'].value_counts()

In [ ]:
country_pd  # total no of people in each country

In [ ]:
country_use_python = country_grp['LanguageHaveWorkedWith'].apply(lambda x: x.str.contains('Python').sum())

In [ ]:
country_use_python   # total no of people in each country knows python

In [ ]:
concat_df = pd.concat([country_pd,country_use_python], axis= 'columns')

In [ ]:
concat_df

In [ ]:
concat_df1 = pd.concat([country_pd,country_use_python])  # example of without axis or axis = 0
concat_df1

In [ ]:
concat_df.rename(columns = {'count': 'totalResponse', 'LanguageHaveWorkedWith': 'pythonKnows' },inplace = True)

In [ ]:
concat_df

In [ ]:
concat_df['perKnowsPython'] = (concat_df['pythonKnows'] / concat_df['totalResponse']) * 100

In [ ]:
concat_df

In [ ]:
concat_df.sort_values(by = 'perKnowsPython',ascending= False)

In [ ]:
concat_df.loc['Germany']

# - Merging DataFrames: merge().

In [ ]:
# merge by column here that represent key

In [ ]:
left = pd.DataFrame({
    'key':['k0','k1','k2'],
    'a':[0,0,0],
    'b':[1,1,1]
})

In [ ]:
right = pd.DataFrame({
    'key':['k0','k1','k2'],
    'c':[0,0,0],
    'd':[1,1,1]
})

In [ ]:
pd.merge(left,right,how='inner',on='key') # how='inner' is by default

In [ ]:
left = pd.DataFrame({
    'key1':['k0','k0','k1','k2'],
    'key2':['k0','k1','k0','k2'],
    'a':[0,0,0,1],
    'b':[1,1,1,2]
})

In [ ]:
right = pd.DataFrame({
    'key1':['k0','k1','k1','k1'],
    'key2':['k0','k0','k2','k0'],
    'c':[0,0,0,2],
    'd':[1,1,1,0]
})

In [ ]:
pd.merge(left,right,on=['key1','key2']) # by default inner merge

In [ ]:
pd.merge(left,right,how='outer',on=['key1','key2']) # by outer merge

In [ ]:
pd.merge(left,right,how='left',on=['key1','key2']) # by left merge

In [ ]:
pd.merge(left,right,how='right',on=['key1','key2']) # by right merge

# - Joining DataFrames: join().

In [ ]:
# joining by index

In [ ]:
left = pd.DataFrame({
    'a':[0,0,0],
    'b':[1,1,1]},
    index=['k0','k1','k2'] )

In [ ]:
right = pd.DataFrame({
    'c':[0,0,0],
    'd':[1,1,1]
},
    index=['k0','k2','k3'])

In [ ]:
left.join(right)

In [ ]:
left.join(right, how= 'outer')

#  crosstab(index, column)

In [ ]:
pd.crosstab(df.Country, df.RemoteWork)

# margins = True

In [ ]:
pd.crosstab(df.Country, df.RemoteWork,margins = True)

In [ ]:
pd.crosstab(df.Country, df.RemoteWork,margins = True)

In [ ]:
df.columns

In [ ]:
df['SurveyLength'].value_counts()

In [ ]:
pd.crosstab([df.Country,df.SurveyLength], df.RemoteWork,margins = True)

In [ ]:
pd.crosstab(df.Country,[df.SurveyLength, df.RemoteWork],margins = True)

In [ ]:
pd.crosstab(df.Country, df.RemoteWork,normalize  = 'index')

In [ ]:
# pd.crosstab(df.Country, df.RemoteWork,values = df.Age, aggfunc = np.average)

# - *Reshaping Data*:
####  - Pivot tables: pivot_table().
####  - Melting data: melt().

In [ ]:
dataset = {'date': ['5/1/2017','2/2/2017','3/5/2017','5/1/2017','2/2/2017','3/5/2017','5/1/2017','2/2/2017','3/5/2017'],
          'city': ['mumbai','mumbai','mumbai','bbsr','bbsr','bbsr','kolkata','kolkata','kolkata'],
          'temperature': [26,36,54,78,98,54,57,94,28],
          'humidity': [57,94,28,36,54,78,98,54,57]}

In [ ]:
reshapedata = pd.DataFrame(dataset)

In [ ]:
reshapedata

In [ ]:
reshapedata.pivot(index= 'date',columns = 'city')

In [ ]:
reshapedata.pivot(index= 'date',columns = 'city',values= 'temperature' )

In [ ]:
reshapedata.pivot(index= 'humidity',columns = 'city')

# pivot_table()

In [ ]:
reshapedata.pivot_table(index= 'date',columns = 'city')

In [ ]:
reshapedata.pivot_table(index= 'date',columns = 'city',values= 'temperature' )

In [ ]:
reshapedata.pivot_table(index= 'city',columns = 'date')

In [ ]:
reshapedata.pivot_table(index= 'city',columns = 'date',aggfunc= 'mean')

In [ ]:
dataset1 = {'date': ['5/1/2017','2/2/2017','5/1/2017','2/2/2017','5/1/2017','2/2/2017','5/1/2017','2/2/2017','5/1/2017'],
          'city': ['mumbai','mumbai','mumbai','bbsr','bbsr','bbsr','mumbai','bbsr','bbsr'],
          'temperature': [26,36,54,78,98,54,57,94,28],
          'humidity': [57,94,28,36,54,78,98,54,57]}

In [ ]:
dataa = pd.DataFrame(dataset1)
dataa

In [ ]:
dataa.pivot_table(index = 'city',columns= 'date')

In [ ]:
dataa.pivot_table(index = 'city',columns= 'date',aggfunc = 'mean')

In [ ]:
dataa.pivot_table(index = 'city',columns= 'date',aggfunc = 'sum')

In [ ]:
dataa.pivot_table(index = 'city',columns= 'date',margins= True)

## convert str to date

In [ ]:
dataa['date'] = pd.to_datetime(dataa['date'])
dataa

In [ ]:
dataa.pivot_table(index = pd.Grouper(freq= 'ME',key= 'date'),columns= 'city')

In [ ]:
#### 6. Working with Time Series
# - *Date and Time Functions*:
#  - Converting to datetime: to_datetime().
#  - Extracting date and time components: .dt accessor.

# - *Time Series Analysis*:
#  - Resampling data: resample().
#  - Rolling windows: rolling().
#  - time series data: date_range(), DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [ ]:
#### 7. Input and Output
# - *Reading and Writing Data*:
#  - Reading data from various formats: read_csv(), read_excel(), read_json().
#  - Writing data to files: to_csv(), to_excel(), to_json().

In [ ]:
#### - Reading data from various formats: read_csv(), read_excel(), read_json().
csv = pd.read_csv()
excel = pd.read_excel()
json = pd.read_json()
df = pd.DataFrame(csv)

In [ ]:
#####  - Writing data to files: to_csv(), to_excel(), to_json().
df.to_csv()
df.to_excel()
df.to_json()

In [ ]:
######  - Writing data to files: to_csv(), to_excel(), to_json().
df.to_csv()
df.to_excel()
df.to_json()
# to do the end of the colon of colon for the

# 33:35 VIDEO STAMP

In [ ]:
#### bash-language-server, dockerfile-language-server-nodejs, javascript-typescript-langserver, jedi-language-server, julia-language-server, pyright, python-language-server, python-lsp-server, r-languageserver, sql-language-server, texlab, typescript-language-server, unified-language-server, vscode-css-languageserver-bin, vscode-html-languageserver-bin, vscode-json-languageserver-bin, yaml-language-server